---
kind: other
id: Properties.T:Autodesk.Revit.DB.ExportPatternKey
source: html/359bfa32-cc55-c785-94ab-0e79853fb655.htm
---
# ExportPatternKey Properties

Specifies whether the .NET object represents a valid Revit entity.